#include <stdio.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <unistd.h>
#include <string.h>

int main()
{
    //1.打开3568开发板的屏幕驱动文件夹:"/dev/fb0"
    int lcd_fd=open("/dev/fb0",O_RDWR);
    if(lcd_fd==-1)
    {
        printf("打开3568开发板的屏幕驱动文件夹失败！！！！\n");
        return -1;
    }

    //2.创建数组和变量为颜色服务
    char B,G,R;
    int color_buf[1024*600]={0};

    for(int i=0;i<1024*600;i++)
    {
        B=235;
        G=206;
        R=135;

        //将BGR转换成颜色值ARGB
        color_buf[i]=B|G<<8|R<<16|0x00<<24;

        //66:  0100 0010
        //2:   0000 0010
        //按位或：1遇到1为1，0遇到0为0，0遇到1为1
        //66|2=68
        //B: 00000000 00000000 00000000 11101011
        //G: 00000000 00001100 00000000 11100110
        //R: 00000000 00000000 00000000 11101011
        //A: 00000000 00000000 00000000 00000000
        
        //左移后
        //A: 00000000 00000000 00000000 00000000
        //R: 00000000 11101011 00000000 00000000 
        //G: 00000000 00001100 11100110 00000000
        //B: 00000000 00000000 00000000 11101011
    }

    //3.将颜色值写入到屏幕驱动文件夹中
    int ret=write(lcd_fd,color_buf,1024*600*4);
    if (ret=-1)
    {
        printf("将颜色值写入到屏幕驱动文件夹中失败！！！！\n");
        return -1;
    }
    
    //4.关闭屏幕驱动文件夹
    close(lcd_fd);
}